beepnl/beep-base-firmware/Source_V1.6.1/Code/nRF/LoRaMac-node-feature-5.0.0/src/boards/nRF52840/nvm_fs.c
#include "nvm_fs.h"

#include <stdint.h>
#include <string.h>
#include "nrf.h"
#include "nordic_common.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "fds.h"
#include "app_error.h"
#define NRF_LOG_MODULE_NAME Flash
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();
#include "nrf_log_ctrl.h"
#include "Commissioning.h"


fds_stat_t stat;
static uint32_t saveTimeCounter = 0;

/* Array to map FDS return values to strings. */
char const * fds_err_str[] =
{
    "FDS_SUCCESS",
    "FDS_ERR_OPERATION_TIMEOUT",
    "FDS_ERR_NOT_INITIALIZED",
    "FDS_ERR_UNALIGNED_ADDR",
    "FDS_ERR_INVALID_ARG",
    "FDS_ERR_NULL_ARG",
    "FDS_ERR_NO_OPEN_RECORDS",
    "FDS_ERR_NO_SPACE_IN_FLASH",
    "FDS_ERR_NO_SPACE_IN_QUEUES",
    "FDS_ERR_RECORD_TOO_LARGE",
    "FDS_ERR_NOT_FOUND",
    "FDS_ERR_NO_PAGES",
    "FDS_ERR_USER_LIMIT_REACHED",
    "FDS_ERR_CRC_CHECK_FAILED",
    "FDS_ERR_BUSY",
    "FDS_ERR_INTERNAL",
};

/* Array to map FDS events to strings. */
static char const * fds_evt_str[] =
{
    "FDS_EVT_INIT",
    "FDS_EVT_WRITE",
    "FDS_EVT_UPDATE",
    "FDS_EVT_DEL_RECORD",
    "FDS_EVT_DEL_FILE",
    "FDS_EVT_GC",
};



/* Flash configuration data. */
static flash_struct_s flash_cfg =
{
    .Major_version			= FIRMWARE_MAJOR,
    .Minor_version			= FIRMWARE_MINOR,
	.Sub_version			= FIRMWARE_SUB,
    .boot_count				= 0,
	.LoRaWANnvm				= {0},
    .devEUI					= LORAWAN_DEVICE_EUI,
	.appEUI					= LORAWAN_JOIN_EUI,
	.appKey					= LORAWAN_APP_KEY,
	.lorawanStatus			= BITMASK_ENABLE | BITMASK_DUTYCYCLE | BITMASK_ADR,	// Enable LoRaWAN, the dutycycle and ADR by default.
	.ds18B20Status			= ((4<<1) | 1),
	.ds18B20Interval		= 10,
	.lorawanRatio			= 0,
	.mainSampleInterval_min	= DEFAULT_LORAWAN_MSG_INTERVAL_MINUTES,
	.pinCodeLenght			= sizeof(PIN_CODE_DEFAULT) - 1,
	.pinCode				= {PIN_CODE_DEFAULT},
	.hx711ConvChannels		= CH_A_GAIN128,
	.hx711nSamples			= 2,
	.attecSerialNumber		= {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08},
    .audioChannel           = DEFAULT_AUDIO_CHANNEL,
    .audioCoarseGain_dB2    = DEFAULT_AUDIO_COARSE_GAIN,
    .audioVolume_dB2        = DEFAULT_AUDIO_VOLUME,
    .min6dBInputDivider     = DEFAULT_AUDIO_INPUT_DIV,
    .fft_count              = DEFAULT_FFT_DIVIDER,
    .fft_start              = DEFAULT_FFT_START,
    .fft_stop               = DEFAULT_FFT_STOP,
    .alarm_DS = 
    {
        .Min    = DEFAULT_DS_TEMP_MIN,
        .Max    = DEFAULT_DS_TEMP_MAX,
        .Diff   = DEFAULT_DS_TEMP_DIFF,
    },

    .alarm_Supply =
    {
        .Max    = DEFAULT_SUPPLY_MAX,
        .Min    = DEFAULT_SUPPLY_MIN,
        .Diff   = DEFAULT_SUPPLY_DIFF,
    },

    .alarm_HX =
    {
        .Max    = DEFAULT_HX_MAX,
        .Min    = DEFAULT_HX_MIN,
        .Diff   = DEFAULT_HX_DIFF,
    },

	.alarm_BME =
	{
        .Temp_Max		= DEFAULT_BME_TEMP_MAX,
        .Temp_Min		= DEFAULT_BME_TEMP_MIN,
        .Temp_Diff		= DEFAULT_BME_TEMP_DIFF,

        .humidity_Max	= DEFAULT_BME_HUMIDITY_MAX,
		.humidity_Min	= DEFAULT_BME_HUMIDITY_MIN,
		.humidity_Diff	= DEFAULT_BME_HUMIDITY_MIN,

		.press_Max		= DEFAULT_BME_PRESSURE_MAX,
		.press_Min		= DEFAULT_BME_PRESSURE_MIN,
		.press_Diff		= DEFAULT_BME_PRESSURE_DIFF,
	},

    // Added Firmware version 1.3.1
    .prev_main_state    = UINT8_MAX,

    // Added Firmware version 1.4.0, revamped for 1.5.0
    .on_state           = ONOFF_STATE_DISABLED,
    .lastTime           = TIME_DEFAULT,

    // Added Firmware version 1.5.1
    .onoff_control      = ONOFF_CONTROL_DEFAULT_VALUE
};

/* A record containing dummy configuration data. */
static fds_record_t const record =
{
    .file_id           = CONFIG_FILE,
    .key               = CONFIG_REC_KEY,
    .data.p_data       = &flash_cfg,
    /* The length of a record is always expressed in 4-byte units (words). */
    .data.length_words = (sizeof(flash_cfg) + 3) / sizeof(uint32_t),
};

typedef struct
{
    volatile bool   initialized;
    volatile bool   dataChanged;
    volatile bool   storeInitiated;
    volatile bool   gc_called;
    uint32_t	    unstoredDataCount;
}NVM_s;    


NVM_s nvm = {
    .initialized		= false,
    .dataChanged		= false,
    .storeInitiated		= false,
    .gc_called			= false,
    .unstoredDataCount	= 0,
};





static void fds_evt_handler(fds_evt_t const * p_evt)
{
    NRF_LOG_INFO("Event: %s received (%s)", fds_evt_str[p_evt->id], fds_err_str[p_evt->result]);

    switch (p_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_evt->result == FDS_SUCCESS)
            {
                nvm.initialized = true;
            }
            break;

        case FDS_EVT_WRITE:
        {
            if (p_evt->result == FDS_SUCCESS)
            {
				NRF_LOG_INFO("FDS_EVT_WRITE");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->write.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->write.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->write.record_key);
				nvm.unstoredDataCount	= 0;
                nvm.dataChanged		= false;
				nvm.storeInitiated	= false;

            }
        } break;

        case FDS_EVT_DEL_RECORD:
        {
            if (p_evt->result == FDS_SUCCESS)
            {
				NRF_LOG_INFO("FDS_EVT_DEL_RECORD");
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
            }
        } break;

	case FDS_EVT_UPDATE:
	    nvm.dataChanged	= false;
	    nvm.storeInitiated	= false;
	    break;

	case FDS_EVT_GC:
	    nvm.dataChanged     = true;
	    nvm.storeInitiated	= false;    
	    nvm.gc_called       = false;
        default:
            break;
    }
}


void nvm_fds_changed(void)
{
    // Reset the save counter for the time and date when the flash is written
    saveTimeCounter = 0;
    nvm.dataChanged = true;
    nvm.unstoredDataCount++;
}



static void nvm_fds_store(void)
{
//    NRF_LOG_INFO(">Store Flash data");
    
    fds_record_desc_t desc  = {0};
    fds_find_token_t  token = {0};

    ret_code_t rc = fds_record_find(CONFIG_FILE, CONFIG_REC_KEY, &desc, &token);

