beepnl/beep-base-firmware/Source_V1.6.1/Code/nRF/LoRaMac-node-feature-5.0.0/src/boards/nRF52840/nvm_fs.c
    if (rc == FDS_SUCCESS)
    {
        fds_flash_record_t config = {0};

        rc = fds_record_update(&desc, &record);
        if(rc == FDS_ERR_NO_SPACE_IN_FLASH) 
        {
            NRF_LOG_INFO("FDS_ERR_NO_SPACE_IN_FLASH, initiating garbage collect");
            if(!nvm.gc_called)
            {
               nvm.gc_called = true;
               fds_gc();
            }
        } 
        else if(rc == FDS_ERR_NO_SPACE_IN_QUEUES)
        {
            NRF_LOG_ERROR("FDS_ERR_NO_SPACE_IN_QUEUES after fds_record_update() call");
        }
        else if(rc != FDS_SUCCESS)
        {
			NRF_LOG_INFO("Update return value: %04X", rc);
            APP_ERROR_CHECK(rc);
        }
    }
    else
    {
        /* struct not found; write a new one. */
        NRF_LOG_INFO("Writing inital data to flash...");

        rc = fds_record_write(&desc, &record);
        APP_ERROR_CHECK(rc);
    }
}


bool nvm_fds_check_busy(void)
{
	return (nvm.dataChanged || nvm.storeInitiated);
}


void nvm_fds_check_pending(void)
{
    if(nvm.dataChanged && !nvm.storeInitiated)
    {
		nvm.storeInitiated = true;
        nvm_fds_store();
    }
}

static void nvm_fds_check_version(void)
{
	const uint32_t current_fw_version = FIRMWARE_TO_UINT32_T(FIRMWARE_MAJOR, FIRMWARE_MINOR, FIRMWARE_SUB);
	const uint32_t stored_fw_version  = FIRMWARE_TO_UINT32_T(flash_cfg.Major_version, flash_cfg.Minor_version, flash_cfg.Sub_version);

	// Check if the current firmware and flash config match
	if(current_fw_version == stored_fw_version)
	{
		return;
	}

    if(stored_fw_version < FIRMWARE_TO_UINT32_T(1, 3, 0)) // 1.3.0
    {
        flash_cfg.audioChannel				= DEFAULT_AUDIO_CHANNEL;
        flash_cfg.audioCoarseGain_dB2		= DEFAULT_AUDIO_COARSE_GAIN;
        flash_cfg.audioVolume_dB2			= DEFAULT_AUDIO_VOLUME;
        flash_cfg.min6dBInputDivider		= DEFAULT_AUDIO_INPUT_DIV;
        flash_cfg.fft_count					= DEFAULT_FFT_DIVIDER;
        flash_cfg.alarm_DS.Min				= DEFAULT_DS_TEMP_MIN;
        flash_cfg.alarm_DS.Max				= DEFAULT_DS_TEMP_MAX;
        flash_cfg.alarm_DS.Diff				= DEFAULT_DS_TEMP_DIFF;
        flash_cfg.alarm_Supply.Max			= DEFAULT_SUPPLY_MAX;
        flash_cfg.alarm_Supply.Min			= DEFAULT_SUPPLY_MIN;
        flash_cfg.alarm_Supply.Diff			= DEFAULT_SUPPLY_DIFF;
        flash_cfg.alarm_HX.Max				= DEFAULT_HX_MAX;
        flash_cfg.alarm_HX.Min				= DEFAULT_HX_MIN;
        flash_cfg.alarm_HX.Diff				= DEFAULT_HX_DIFF;
        flash_cfg.alarm_BME.Temp_Max		= DEFAULT_BME_TEMP_MAX;
		flash_cfg.alarm_BME.Temp_Min		= DEFAULT_BME_TEMP_MIN;
		flash_cfg.alarm_BME.Temp_Diff		= DEFAULT_BME_TEMP_DIFF;
		flash_cfg.alarm_BME.humidity_Max	= DEFAULT_BME_HUMIDITY_MAX;
		flash_cfg.alarm_BME.humidity_Min	= DEFAULT_BME_HUMIDITY_MIN;
		flash_cfg.alarm_BME.humidity_Diff	= DEFAULT_BME_HUMIDITY_DIFF;
		flash_cfg.alarm_BME.press_Max		= DEFAULT_BME_PRESSURE_MAX;
		flash_cfg.alarm_BME.press_Min		= DEFAULT_BME_PRESSURE_MIN;
		flash_cfg.alarm_BME.press_Diff		= DEFAULT_BME_PRESSURE_DIFF;
	}

    if(stored_fw_version < FIRMWARE_TO_UINT32_T(1, 3, 1)) // 1.3.1
    {
        flash_cfg.prev_main_state           = UINT8_MAX;
    }

    // For firmware updates below 1.5.0
    if(stored_fw_version < FIRMWARE_TO_UINT32_T(1, 5, 0)) // fw < 1.5.0
    {
        /* Check if the SQ_min 200 is enabled or not for fw versions 1.4.0, 1.4.1 and 1.4.2. When sq_state is low enable the reedswitch and the tilt 
         * sensor otherwise only the reedswitch needs to be enabled
         */
        if(stored_fw_version >= FIRMWARE_TO_UINT32_T(1, 4, 0) && !flash_cfg.on_state)
        {
            flash_cfg.onoff_control = ONOFF_CONTROL_MASK;
        }
        // Enable the tilt and reed switch for firmware versions below 1.4.0
        else if(stored_fw_version < FIRMWARE_TO_UINT32_T(1, 4, 0))
        {
            flash_cfg.onoff_control = ONOFF_CONTROL_MASK;
        }
        else
        {
            flash_cfg.onoff_control = ONOFF_CONTROL_DEFAULT_VALUE;
        }
        flash_cfg.on_state          = ONOFF_STATE_ENABLED;
        flash_cfg.lastTime          = TIME_DEFAULT;
    }
    else
    {
        if(stored_fw_version < FIRMWARE_TO_UINT32_T(1, 5, 1)) // 1.5.1 Enable the reedswitch by default
        {
            flash_cfg.onoff_control             = ONOFF_CONTROL_DEFAULT_VALUE;
        }
    }

	NRF_LOG_INFO("Older Flash version detected: %u != %u", current_fw_version, stored_fw_version);
	NRF_LOG_FLUSH();

	// Update the flash storage fw version 
	flash_cfg.Major_version	= FIRMWARE_MAJOR;
	flash_cfg.Minor_version = FIRMWARE_MINOR;
	flash_cfg.Sub_version	= FIRMWARE_SUB;
    nvm_fds_changed();
}

static void nvm_fds_check_parameters(void)
{
    if(flash_cfg.audioChannel > AIN_IN2RP)
    {
        flash_cfg.audioChannel = DEFAULT_AUDIO_CHANNEL;
    }

    if(flash_cfg.audioCoarseGain_dB2 > (40 * 2)) // Max +40 dBm
    {
        flash_cfg.audioCoarseGain_dB2   = DEFAULT_AUDIO_COARSE_GAIN;
    }

    if((flash_cfg.min6dBInputDivider != true) && (flash_cfg.min6dBInputDivider != false))
    {
        flash_cfg.min6dBInputDivider = DEFAULT_AUDIO_INPUT_DIV;
    }

    if(flash_cfg.audioVolume_dB2 < -24 || flash_cfg.audioVolume_dB2 > 40)
    {
        flash_cfg.audioVolume_dB2 = DEFAULT_AUDIO_VOLUME;
    }

    if(flash_cfg.fft_count == 0 || flash_cfg.fft_count > FFT_MAX_BINS)
    {
        flash_cfg.fft_count = DEFAULT_FFT_DIVIDER;
    }

    if(flash_cfg.fft_start >= flash_cfg.fft_stop)
    {
        flash_cfg.fft_start = DEFAULT_FFT_START;
        flash_cfg.fft_stop  = DEFAULT_FFT_STOP;
    }

    // Check if the pin code is invalid.
    if(!is_array_ASCIInumbers(flash_cfg.pinCode, PIN_CODE_BLE_LENGHT))
    {
        uint8_t pincode[PIN_CODE_BLE_LENGHT] = {PIN_CODE_DEFAULT};
        memcpy(flash_cfg.pinCode, pincode, PIN_CODE_BLE_LENGHT);
    }


    // Check the limits of the Alarms
    if( (uint16_t)flash_cfg.alarm_DS.Max  == UINT16_MAX && 
        (uint16_t)flash_cfg.alarm_DS.Min  == UINT16_MAX && 
        (uint16_t)flash_cfg.alarm_DS.Diff == UINT16_MAX)
    {
        flash_cfg.alarm_DS.Min    = DEFAULT_DS_TEMP_MIN;
        flash_cfg.alarm_DS.Max    = DEFAULT_DS_TEMP_MAX;
        flash_cfg.alarm_DS.Diff   = DEFAULT_DS_TEMP_DIFF;
    }

    if( (uint32_t)flash_cfg.alarm_HX.Max  == UINT32_MAX &&
        (uint32_t)flash_cfg.alarm_HX.Min  == UINT32_MAX &&
        (uint32_t)flash_cfg.alarm_HX.Diff == UINT32_MAX)
    {
        flash_cfg.alarm_HX.Max    = DEFAULT_HX_MAX ;
        flash_cfg.alarm_HX.Min    = DEFAULT_HX_MIN;
        flash_cfg.alarm_HX.Diff   = DEFAULT_HX_DIFF;
    }

    if( flash_cfg.alarm_Supply.Max  == UINT16_MAX && 
        flash_cfg.alarm_Supply.Min  == UINT16_MAX && 
        flash_cfg.alarm_Supply.Diff == UINT16_MAX)
    {
        flash_cfg.alarm_Supply.Max    = DEFAULT_SUPPLY_MAX;
        flash_cfg.alarm_Supply.Min    = DEFAULT_SUPPLY_MIN;
        flash_cfg.alarm_Supply.Diff   = DEFAULT_SUPPLY_DIFF;
    }

	// BME280 Temp
	if( (uint16_t)flash_cfg.alarm_BME.Temp_Max  == UINT16_MAX &&
		(uint16_t)flash_cfg.alarm_BME.Temp_Min  == UINT16_MAX &&
		(uint16_t)flash_cfg.alarm_BME.Temp_Diff == UINT16_MAX)
	{
		flash_cfg.alarm_BME.Temp_Max	= DEFAULT_BME_TEMP_MAX;
		flash_cfg.alarm_BME.Temp_Min	= DEFAULT_BME_TEMP_MIN;
		flash_cfg.alarm_BME.Temp_Diff	= DEFAULT_BME_TEMP_DIFF;
	}

    if( flash_cfg.alarm_BME.humidity_Max  == UINT16_MAX &&
		flash_cfg.alarm_BME.humidity_Min  == UINT16_MAX &&
		flash_cfg.alarm_BME.humidity_Diff == UINT16_MAX)
	{
		flash_cfg.alarm_BME.humidity_Max  = DEFAULT_BME_HUMIDITY_MAX;
		flash_cfg.alarm_BME.humidity_Min  = DEFAULT_BME_HUMIDITY_MIN;
		flash_cfg.alarm_BME.humidity_Diff = DEFAULT_BME_HUMIDITY_DIFF;
	}

    if( flash_cfg.alarm_BME.press_Max  == UINT16_MAX &&
		flash_cfg.alarm_BME.press_Min  == UINT16_MAX &&
		flash_cfg.alarm_BME.press_Diff == UINT16_MAX)
	{
		flash_cfg.alarm_BME.press_Max  = DEFAULT_BME_PRESSURE_MAX;
		flash_cfg.alarm_BME.press_Min  = DEFAULT_BME_PRESSURE_MIN;
		flash_cfg.alarm_BME.press_Diff = DEFAULT_BME_PRESSURE_DIFF;
	}

    // Keep the time positive
    if(flash_cfg.lastTime < 0)
    {
        flash_cfg.lastTime = 0;
    }

    // When the on off control is either 0 or other bits than the mask are set, set it to default values.
    if(flash_cfg.onoff_control == 0 || flash_cfg.onoff_control & ~ONOFF_CONTROL_MASK)
    {
        flash_cfg.onoff_control = ONOFF_CONTROL_DEFAULT_VALUE;
    }
}



