beepnl/beep-base-firmware/Source_V1.6.1/Code/nRF/LoRaMac-node-feature-5.0.0/src/boards/nRF52840/nvm_fs.c
void nvm_fds_init(void)
{
    uint32_t retVal;
    NRF_LOG_INFO("FDS init started.")

    /* Register first to receive an event when initialization is complete. */
    fds_register(fds_evt_handler);

    NRF_LOG_INFO("Initializing fds...");

    retVal = fds_init();

    while (!nvm.initialized)
    {
        #ifdef SOFTDEVICE_PRESENT
	    (void) sd_app_evt_wait();
		#else
			__WFE();
		#endif
    }

    // Clear the stat structure
    memset(&stat, 0, sizeof(fds_stat_t));

    retVal = fds_stat(&stat);
    APP_ERROR_CHECK(retVal);

    NRF_LOG_INFO("Found %d valid records and %d dirty records (ready to be garbage collected).", stat.valid_records, stat.dirty_records);

    fds_record_desc_t desc = {0};
    fds_find_token_t  tok  = {0};

    // Find the record in the flash.
    retVal = fds_record_find(CONFIG_FILE, CONFIG_REC_KEY, &desc, &tok);

    if (retVal == FDS_SUCCESS)
    {
        /* A config file is in flash. Let's update it. */
        fds_flash_record_t config = {0};

        /* Open the record and read its contents. */
        retVal = fds_record_open(&desc, &config);
        APP_ERROR_CHECK(retVal); 

		// Copy the Flash data contents in the ram to the NVM_s structure.
		memcpy(&flash_cfg, config.p_data, sizeof(flash_struct_s));

        /* Close the record when done reading. */
        retVal = fds_record_close(&desc);
        APP_ERROR_CHECK(retVal);

        /* Write the updated record to flash. */
        retVal = fds_record_update(&desc, &record);

		if(retVal != FDS_SUCCESS)
		{
			NRF_LOG_INFO("fds_record_update error: %u/0x%04X = %s", retVal, retVal, fds_err_str[retVal]);

			if(retVal == FDS_ERR_NO_SPACE_IN_FLASH)
			{
				// Perform a garbage collect to remove all dirty records, then retry updating the record.
				fds_gc();
				retVal = fds_record_update(&desc, &record);
			}
			APP_ERROR_CHECK(retVal);
		}

        NRF_LOG_INFO("Config file found revision: %u.%u.%u, boot count: %d.", flash_cfg.Major_version, flash_cfg.Minor_version, flash_cfg.Sub_version, flash_cfg.boot_count);

        /* Update boot count. */
        flash_cfg.boot_count++;

        /* Check the stored firmware version to identify missing parameters which might have been adeed in a new release. */
        nvm_fds_check_version();

        /* Check if the parameters are within a valid range */
        nvm_fds_check_parameters();
    }
    else
    {
        /* System config not found; write a new one. */
        NRF_LOG_INFO("Config file not found, writing new file...");

        retVal = fds_record_write(&desc, &record);
        APP_ERROR_CHECK(retVal);

        retVal = fds_stat(&stat);
        APP_ERROR_CHECK(retVal);

    }
}


void nvm_fds_eeprom_wrapper_read( uint16_t addr, uint8_t *buffer, uint16_t size )
{
	uint16_t i;

	if((addr + size) >= LORAWAN_NVM_SIZE){
		return;
	}

	for( i = 0 ; i < size ; i++)
	{
		buffer[i] = flash_cfg.LoRaWANnvm[addr + i];
	}
}


void nvm_fds_eeprom_wrapper_write( uint16_t addr, uint8_t *buffer, uint16_t size )
{
	uint16_t i;

	if((addr + size) >= LORAWAN_NVM_SIZE){
		return;
	}

	for( i = 0 ; i < size ; i++)
	{
		flash_cfg.LoRaWANnvm[addr + i] = buffer[i];
	}
}


uint32_t nvm_fds_eeprom_get(BEEP_protocol_s * prot)
{
	if(prot == NULL)
	{
		return NRF_ERROR_NULL;
	}

	switch(prot->command)
	{
		//-----------------------------------------------------------------------------
		case READ_FIRMWARE_VERSION:
		{
			FH_VERSION_s * version = &prot->param.version;
            version->major	= FIRMWARE_MAJOR;
            version->minor	= FIRMWARE_MINOR;
            version->sub	= FIRMWARE_SUB;
            version->id		= 0;
			break;
		}

        //-----------------------------------------------------------------------------
		case READ_HARDWARE_VERSION:
		{
			#ifdef DEBUG
				uint32_t revision = (HARDWARE_MAJOR << 16) | (HARDWARE_MINOR << 0);
				uint32_t hardware = HARDWARE_ID;
			#else
				uint32_t revision = NRF_UICR->CUSTOMER[UICR_HARDWARE_REVISION_LOCATION];
				uint32_t hardware = NRF_UICR->CUSTOMER[UICR_HARDWARE_SERIAL_NUMBER];
			#endif

            FH_VERSION_s * version = &prot->param.version;
            version->major	= (uint16_t)(revision >> 16);
            version->minor	= (uint16_t)(revision >> 0);
            version->sub	= 0;
			version->id		= hardware;
			break;
		}

		//-----------------------------------------------------------------------------
		case READ_LORAWAN_DEVEUI:
			prot->param.lorawan_key.lenght = 8;
			memcpy(&prot->param.lorawan_key.data, flash_cfg.devEUI,  prot->param.lorawan_key.lenght);
			break;
		case READ_LORAWAN_APPEUI:
			prot->param.lorawan_key.lenght = 8;
			memcpy(&prot->param.lorawan_key.data, flash_cfg.appEUI, prot->param.lorawan_key.lenght);
			break;
		case READ_LORAWAN_APPKEY:
			prot->param.lorawan_key.lenght = 16;
			memcpy(&prot->param.lorawan_key.data, flash_cfg.appKey, prot->param.lorawan_key.lenght);
			break;

		case READ_LORAWAN_STATE:
			prot->param.status.statusflag = flash_cfg.lorawanStatus;
			break;

		//-----------------------------------------------------------------------------
		case READ_DS18B20_STATE:
			prot->param.status.statusflag = flash_cfg.ds18B20Status; 
            prot->param.status.interval	  = flash_cfg.ds18B20Interval;
			break;

		//-----------------------------------------------------------------------------
		case READ_ATECC_READ_ID:
            memcpy(prot->param.atecc_id.ROM, flash_cfg.attecSerialNumber, ATECC_ID_LENGHT);
			break;

        //-----------------------------------------------------------------------------
		case READ_PINCODE:
		case WRITE_PINCODE:
			flash_cfg.pinCodeLenght = PIN_CODE_BLE_LENGHT;
			prot->param.lorawan_key.lenght	= flash_cfg.pinCodeLenght;
			memcpy(prot->param.lorawan_key.data, flash_cfg.pinCode, flash_cfg.pinCodeLenght);	
			break;

		//-----------------------------------------------------------------------------
		case READ_APPLICATION_CONFIG:
			prot->param.status.statusflag   = flash_cfg.lorawanRatio; 
            prot->param.status.interval     = flash_cfg.mainSampleInterval_min;		
			break;

