beepnl/beep-base-firmware/Source_V1.6.1/Code/nRF/LoRaMac-node-feature-5.0.0/src/boards/nRF52840/nvm_fs.c
		//-----------------------------------------------------------------------------
		case READ_HX711_STATE:
			prot->param.status.statusflag	= flash_cfg.hx711ConvChannels; 
            prot->param.status.interval		= flash_cfg.hx711nSamples;
			break;

		//-----------------------------------------------------------------------------
        case READ_BOOT_COUNT:
            prot->param.status.interval     = flash_cfg.boot_count;
            break;

		//-----------------------------------------------------------------------------
        case READ_AUDIO_ADC_CONFIG:
        {
            AUDIO_CONFIG_s * conf = &prot->param.audio_config;
            conf->channel       = flash_cfg.audioChannel;
            conf->gain          = flash_cfg.audioCoarseGain_dB2;
            conf->volume        = flash_cfg.audioVolume_dB2;
            conf->min6dB        = flash_cfg.min6dBInputDivider;
            conf->fft_count     = flash_cfg.fft_count;
            conf->fft_start     = flash_cfg.fft_start;
            conf->fft_stop      = flash_cfg.fft_stop;
            break;
        }

        //-----------------------------------------------------------------------------
        case ALARM_CONFIG_READ:
        {
            ALARM_CONFIG_s * alarm = &prot->param.alarm;
            switch(alarm->type)
            {
                case DS18B20:
                    memcpy(&alarm->thr, &flash_cfg.alarm_DS, sizeof(DS_ALARM_s));
                    break;

                case HX711:
                    memcpy(&alarm->thr, &flash_cfg.alarm_HX, sizeof(HX711_ALARM_s));
                    break;
                case BME280:
                    memcpy(&alarm->thr, &flash_cfg.alarm_BME, sizeof(BME_ALARM_s));
                    break;
                case nRF_ADC:
                    memcpy(&alarm->thr, &flash_cfg.alarm_Supply, sizeof(SUPPLY_ALARM_s));
                    break;
                default:
                    return NRF_ERROR_INVALID_PARAM;
                    break;
            }
            break;
        }

        //-----------------------------------------------------------------------------
        case READ_ON_STATE:
        case WRITE_ON_STATE:
        {
            prot->param.status.statusflag = flash_cfg.on_state;
            break;
        }

        //-----------------------------------------------------------------------------
        case READ_REED_STATE:
        case WRITE_REED_STATE:
        {
            prot->param.status.statusflag = (flash_cfg.onoff_control & ONOFF_CONTROL_REEDSWITCH_MASK) ? 0x01 : 0x00;
            break;
        }
        
        //-----------------------------------------------------------------------------
        case READ_SQ_MIN_STATE:
        case WRITE_SQ_MIN_STATE:
        {
            prot->param.status.statusflag = (flash_cfg.onoff_control & ONOFF_CONTROL_TILTSWITCH_MASK) ? 0x01 : 0x00;
            break;
        }

                    
		//-----------------------------------------------------------------------------
		default:
			return NRF_ERROR_NOT_FOUND;
			break;
	}
    return NRF_SUCCESS;
}


uint32_t nvm_fds_eeprom_set(BEEP_protocol_s * prot)
{
	if(prot == NULL)
	{
		return NRF_ERROR_NULL;
	}

	switch(prot->command)
	{
		//-----------------------------------------------------------------------------
		case WRITE_LORAWAN_DEVEUI:
			memcpy(flash_cfg.devEUI, &prot->param.lorawan_key.data, 8);
			break;
		case WRITE_LORAWAN_APPEUI:
			memcpy(flash_cfg.appEUI, &prot->param.lorawan_key.data, 8);
			break;
		case WRITE_LORAWAN_APPKEY:
			memcpy(flash_cfg.appKey, &prot->param.lorawan_key.data, 16);
			break;
		case READ_LORAWAN_STATE:
			flash_cfg.lorawanStatus = prot->param.status.statusflag;
			break;

		//-----------------------------------------------------------------------------
		case READ_DS18B20_STATE:
			flash_cfg.ds18B20Status		= prot->param.status.statusflag; 
            flash_cfg.ds18B20Interval	= prot->param.status.interval;
			break;

        //-----------------------------------------------------------------------------
		case READ_APPLICATION_CONFIG:
		case WRITE_APPLICATION_CONFIG:
			if(prot->param.status.interval == 0)
			{
				return NRF_ERROR_INVALID_PARAM;
			}
			flash_cfg.lorawanRatio				= prot->param.status.statusflag; 
            flash_cfg.mainSampleInterval_min	= prot->param.status.interval;		
			break;

        //-----------------------------------------------------------------------------
		case READ_PINCODE:
		case WRITE_PINCODE:
			if(prot->param.lorawan_key.lenght != PIN_CODE_BLE_LENGHT)
			{
				return NRF_ERROR_INVALID_PARAM;
			}
			flash_cfg.pinCodeLenght = prot->param.lorawan_key.lenght;
			memset(flash_cfg.pinCode, 0, PIN_CODE_LENGHT_MAX + 1); // Clear the pincode buffer
			memcpy(flash_cfg.pinCode, prot->param.lorawan_key.data, flash_cfg.pinCodeLenght);	
			break;

		//-----------------------------------------------------------------------------
		case WRITE_HX711_STATE:
			// Check if any other bits are set other than the channel bits.
			if(prot->param.status.statusflag & ~CH_HX_BITMASK)
			{
				return NRF_ERROR_INVALID_PARAM;
			}

			// Store the channels on which the HX711 must convert on each sample interval.
			flash_cfg.hx711ConvChannels = prot->param.status.statusflag;
            flash_cfg.hx711nSamples		= prot->param.status.interval;
			break;

        //-----------------------------------------------------------------------------
		case READ_ATECC_READ_ID:
            memcpy(flash_cfg.attecSerialNumber, prot->param.atecc_id.ROM, ATECC_ID_LENGHT);
			break;

        //-----------------------------------------------------------------------------
        case WRITE_BOOT_COUNT:
            flash_cfg.boot_count = prot->param.status.interval;
            break;

        //-----------------------------------------------------------------------------
        case READ_AUDIO_ADC_CONFIG:
        case WRITE_AUDIO_ADC_CONFIG:
        {
            AUDIO_CONFIG_s * conf = &prot->param.audio_config;

            if(conf->channel > AIN_IN2RP)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            if(conf->gain > (40 * 2)) // Max +40 dBm
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            if(conf->volume < -24 || conf->volume > 40)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            if(conf->fft_count == 0 || conf->fft_count > FFT_MAX_BINS)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

            if(conf->fft_start >= conf->fft_stop)
            {
                return NRF_ERROR_INVALID_PARAM;
            }

