beepnl/beep-base-firmware/Source_V1.6.1/Code/nRF/LoRaMac-node-feature-5.0.0/src/boards/nRF52840/nvm_fs.c
            flash_cfg.audioChannel          = conf->channel;
            flash_cfg.audioCoarseGain_dB2   = conf->gain;
            flash_cfg.audioVolume_dB2       = conf->volume;
            flash_cfg.fft_count             = conf->fft_count;
            flash_cfg.fft_start             = conf->fft_start;
            flash_cfg.fft_stop              = conf->fft_stop;
            break;
        }

		//-----------------------------------------------------------------------------
        case ALARM_CONFIG_WRITE:
        {
            ALARM_CONFIG_s * alarm = &prot->param.alarm;
            switch(alarm->type)
            {
                case DS18B20:
                    if(alarm->thr.ds.Min > alarm->thr.ds.Max || alarm->thr.ds.Diff == 0)
                    {
                        return NRF_ERROR_INVALID_PARAM;
                    }
                    memcpy(&flash_cfg.alarm_DS, &alarm->thr.ds, sizeof(DS_ALARM_s));
                    break;

                case HX711:
                    if(alarm->thr.hx.Min > alarm->thr.hx.Max || alarm->thr.hx.Diff == 0)
                    {
                        return NRF_ERROR_INVALID_PARAM;
                    }
                    memcpy(&flash_cfg.alarm_HX, &alarm->thr.hx, sizeof(HX711_ALARM_s));
                    break;

                case BME280:
                    if( alarm->thr.bme.Temp_Min > alarm->thr.bme.Temp_Max           || alarm->thr.bme.Temp_Diff == 0        ||
                        alarm->thr.bme.humidity_Min > alarm->thr.bme.humidity_Max   || alarm->thr.bme.humidity_Diff == 0    ||
                        alarm->thr.bme.press_Min > alarm->thr.bme.press_Max         || alarm->thr.bme.press_Diff == 0)
                    {
                        return NRF_ERROR_INVALID_PARAM;
                    }
					memcpy(&flash_cfg.alarm_BME, &alarm->thr.bme, sizeof(BME_ALARM_s));
                    break;

                case nRF_ADC:
                    if(alarm->thr.supply.Min > alarm->thr.supply.Max || alarm->thr.supply.Diff == 0)
                    {
                        return NRF_ERROR_INVALID_PARAM;
                    }
                    memcpy(&flash_cfg.alarm_Supply, &alarm->thr.supply, sizeof(SUPPLY_ALARM_s));
                    break;

                default:
                    return NRF_ERROR_INVALID_PARAM;
                    break;
            }
            break;
        }

        //-----------------------------------------------------------------------------
        case READ_ON_STATE:
        case WRITE_ON_STATE:
        {
            // fw 1.5.0 changed
            flash_cfg.on_state = prot->param.status.statusflag ? ONOFF_STATE_ENABLED : ONOFF_STATE_DISABLED;
            break;
        }

        //-----------------------------------------------------------------------------
        case READ_SQ_MIN_STATE:
        case WRITE_SQ_MIN_STATE:
        {
            if(prot->param.status.statusflag)
            {
                flash_cfg.onoff_control |= ONOFF_CONTROL_TILTSWITCH_MASK;
            }
            else
            {
                flash_cfg.onoff_control &= ~ONOFF_CONTROL_TILTSWITCH_MASK;
            }
            break;
        }

        //-----------------------------------------------------------------------------
        case READ_REED_STATE:
        case WRITE_REED_STATE:
        {
            if(prot->param.status.statusflag)
            {
                flash_cfg.onoff_control |= ONOFF_CONTROL_REEDSWITCH_MASK;
            }
            else
            {
                flash_cfg.onoff_control &= ~ONOFF_CONTROL_REEDSWITCH_MASK;
            }
            break;
        }

		//-----------------------------------------------------------------------------
		default:
			return NRF_ERROR_NOT_FOUND;
			break;	
	}
    nvm_fds_changed();
    return NRF_SUCCESS;
}




uint32_t    nvm_fds_internal_param_get(INTERNAL_PARAM * internal)
{
    if(internal == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    switch(internal->param)
    {
        //----------------------------------------------------------------------------------
        case PREVIOUS_MAIN_STATE:
            internal->value.previous_state = flash_cfg.prev_main_state;
            break;

        //----------------------------------------------------------------------------------
        default:
            return NRF_ERROR_INVALID_STATE;
            break;
    }
    return NRF_SUCCESS;
}



uint32_t    nvm_fds_internal_param_set(INTERNAL_PARAM * internal)
{
    if(internal == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    switch(internal->param)
    {
        //----------------------------------------------------------------------------------
        case PREVIOUS_MAIN_STATE:
            flash_cfg.prev_main_state = internal->value.previous_state;
            break;

        //----------------------------------------------------------------------------------
        default:
            return NRF_ERROR_INVALID_STATE;
            break;
    }
    nvm_fds_changed();    
    return NRF_SUCCESS;
}

bool nvm_toggle_on_state(void)
{
    flash_cfg.on_state = (flash_cfg.on_state == ONOFF_STATE_DISABLED) ? ONOFF_STATE_ENABLED : ONOFF_STATE_DISABLED;
    NRF_LOG_INFO("Reedswitch new state = %s", flash_cfg.on_state ? "On" : "Off");
    nvm_fds_changed();
    return (bool) flash_cfg.on_state;
}


bool nvm_get_on_state(void)
{
    return (bool) flash_cfg.on_state;
}

time_t nvm_getLastTime(void)
{
    return flash_cfg.lastTime;
}

/*@Brief Sets the current time value in the flash, but doesn't force an store
 */
void nvm_setLastTime(const time_t newTime)
{
    flash_cfg.lastTime = newTime;

    // Force a flash save of the time and date every 48 hours since the last flash write.
    if(saveTimeCounter++ >= TIME_SAVE_INTERVAL_MIN)
    {
        saveTimeCounter = 0;
        nvm_fds_changed();
    }
}

bool nvm_reedSwitchEnabled(void)
{
    return (flash_cfg.onoff_control & ONOFF_CONTROL_REEDSWITCH_MASK) ? true : false;
}

bool nvm_tiltSwitchEnabled(void)
{
    return (flash_cfg.onoff_control & ONOFF_CONTROL_TILTSWITCH_MASK) ? true : false;
}


/**
*@Brief:    This function reads the first three UICR registers in order to retrieve the hardware ID, otherwise provided by the ATECC
*/
void uicr_getHWid(void)
{
	BEEP_protocol_s prot;

    // Read the UICR registers
    uint32_t reg0 = NRF_UICR->CUSTOMER[UICR_ATECC_ID_1];
    uint32_t reg1 = NRF_UICR->CUSTOMER[UICR_ATECC_ID_2];
    uint32_t reg2 = NRF_UICR->CUSTOMER[UICR_ATECC_ID_3];

    prot.param.atecc_id.ROM[0] = (uint8_t) (reg0 >> 24); // Get the MSB
    prot.param.atecc_id.ROM[1] = (uint8_t) (reg0 >> 16); // Get 3th byte
    prot.param.atecc_id.ROM[2] = (uint8_t) (reg0 >>  8); // Get the 2nd byte
    prot.param.atecc_id.ROM[3] = (uint8_t) (reg0 >>  0); // Get the LSB
    prot.param.atecc_id.ROM[4] = (uint8_t) (reg1 >> 24); // Get the MSB
    prot.param.atecc_id.ROM[5] = (uint8_t) (reg1 >> 16); // Get 3th byte
    prot.param.atecc_id.ROM[6] = (uint8_t) (reg1 >>  8); // Get the 2nd byte
    prot.param.atecc_id.ROM[7] = (uint8_t) (reg1 >>  0); // Get the LSB
    prot.param.atecc_id.ROM[8] = (uint8_t) (reg2 >> 24); // Get the MSB

    // Save the ATECC608A ID
    prot.command = READ_ATECC_READ_ID;
    nvm_fds_eeprom_set(&prot);

    #if 1
        NRF_LOG_INFO("uicr_getHWid:");
        NRF_LOG_HEXDUMP_INFO(&prot.param.atecc_id.ROM, 9);
    #endif
}























